Tekla Open API Reference for Tekla Structures 2025
ViewMarkBasicSymbolAttributes Class
 The ViewMarkBasicSymbolAttributes class contains basic attributes for mark symbols.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.GenericAttributesBase
 Tekla.Structures.Drawing.ViewMarkBasicSymbolAttributes
 Tekla.Structures.Drawing.DetailMarkSymbolAttributes
 Tekla.Structures.Drawing.View.ViewMarkSymbolAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class ViewMarkBasicSymbolAttributes : GenericAttributesBase
<SerializableAttribute>
Public MustInherit Class ViewMarkBasicSymbolAttributes
	Inherits GenericAttributesBase
The ViewMarkBasicSymbolAttributes type exposes the following members.
Constructors
Name | Description
ViewMarkBasicSymbolAttributes()
 Creates a new mark symbol attributes instance.
ViewMarkBasicSymbolAttributes(Double, MarkSymbolShape)
 Creates a new mark symbol attributes instance with the given size and shape.
Top
Properties
Name | Description
Shape
 The shape of the mark symbol.
Size
 The size of the mark symbol.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides GenericAttributesBase.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace